# tuh8gz - DS 2002 - Project 1 - Sakila DB

#### Importing all libraries needed:

In [ ]:
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine
import json

import pymongo
from sqlalchemy import create_engine

#### Connection:

In [2]:
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Tallwood2022"

dbname = "sakila"
dbname2 = "sakila_dw2"

In [3]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Importing from MySQL:

In [4]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dbname2}`;")
sqlEngine.execute(f"CREATE DATABASE `{dbname2}`;")
sqlEngine.execute(f"USE {dbname2};")

#### Data tables from MySQL:
getting movie rental process data: inventory, customer, store, film, payment, rentals , and address

In [6]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, dbname, sql_inventory)
df_inventory.head(2)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17

In [5]:
sql_customer = "SELECT * FROM sakila.customer;"
df_customer = get_dataframe(user_id, pwd, host_name, dbname, sql_customer)
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [8]:
sql_store = "SELECT * FROM sakila.store;"
df_store = get_dataframe(user_id, pwd, host_name, dbname, sql_store)
df_store.head(2)

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 04:57:12
1         2                 2           2 2006-02-15 04:57:12

In [7]:
sql_film = "SELECT * FROM sakila.film;"
df_film = get_dataframe(user_id, pwd, host_name, dbname, sql_film)
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [9]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(user_id, pwd, host_name, dbname, sql_payment)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [10]:
sql_rental = "SELECT * FROM sakila.rental;"
df_rental = get_dataframe(user_id, pwd, host_name, dbname, sql_rental)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [11]:
sql_address = "SELECT * FROM sakila.address;"
df_address = get_dataframe(user_id, pwd, host_name, dbname, sql_address)
df_address.head(2)

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09

In [12]:
drop_cols = ['email','address_id','create_date','last_update']
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.head(2)

   customer_id  store_id first_name last_name  active
0            1         1       MARY     SMITH       1
1            2         1   PATRICIA   JOHNSON       1

#### Transformations/Cleaning & load from local file:

In [13]:
drop_cols = ['last_update']
df_inventory.drop(drop_cols, axis=1, inplace=True)
#load
#df_inventory = pd.read_csv('/Users/ds2002/Downloads/sakila.inventory.csv',header=0)
df_inventory.head(2)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1

In [15]:
drop_cols = ['manager_staff_id', 'last_update']
df_store.drop(drop_cols, axis=1, inplace=True)
df_store.head(2)

   store_id  address_id
0         1           1
1         2           2

In [14]:
#more cleaning
drop_cols = ['description', 'language_id', 'special_features', 'length', 'rating', 'last_update', 'release_year', 'original_language_id']
df_film.drop(drop_cols, axis=1, inplace=True)
df_film.head(2)

   film_id             title  rental_duration  rental_rate  replacement_cost
0        1  ACADEMY DINOSAUR                6         0.99             20.99
1        2    ACE GOLDFINGER                3         4.99             12.99

In [16]:
drop_cols = ['last_update', 'staff_id']
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.head(2)

   payment_id  customer_id  rental_id  amount        payment_date
0           1            1         76    2.99 2005-05-25 11:30:37
1           2            1        573    0.99 2005-05-28 10:35:23

In [17]:
drop_cols = ['last_update']
df_rental.drop(drop_cols, axis=1, inplace=True)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [18]:
drop_cols = ['district', 'city_id', 'postal_code','phone','location','last_update','address2']
df_address.drop(drop_cols, axis=1, inplace=True)
df_address.head(2)

   address_id             address
0           1   47 MySakila Drive
1           2  28 MySQL Boulevard

#### Load df into new dw:

In [19]:
db_operation = "insert"
tables = [('dim_inventory', df_inventory, 'inventory_id'),
          ('dim_customers', df_customer, 'customer_id'),
          ('dim_store', df_store, 'store_id'),
          ('dim_film', df_film, 'film_id'),
          ('dim_payment', df_payment, 'payment_id'),
          ('dim_rental', df_rental, 'rental_id')]

In [20]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dbname2, dataframe, table_name, primary_key, db_operation)

#### Create fact table:

In [23]:
#merge inventory and film 
df_inventory = pd.merge(df_inventory, df_film, on= "film_id", how = "inner")
df_inventory.drop(['film_id'], axis = 1, inplace = True)
df_inventory.head(2)

,inventory_id,store_id,title,rental_duration,rental_rate,replacement_cost
0,1,1,ACADEMY DINOSAUR,6,0.99,20.99
1,2,1,ACADEMY DINOSAUR,6,0.99,20.99

In [24]:
#merge inventory and store 
df_inventory = pd.merge(df_inventory, df_store, on= "store_id", how = "inner")
df_inventory.drop(['store_id'], axis = 1, inplace = True)
df_inventory.head(2)

,inventory_id,title,rental_duration,rental_rate,replacement_cost,address
0,1,ACADEMY DINOSAUR,6,0.99,20.99,47 MySakila Drive
1,2,ACADEMY DINOSAUR,6,0.99,20.99,47 MySakila Drive

In [22]:
df_customer = pd.merge(df_customer, df_payment, on= "customer_id", how = "inner")
df_customer.drop(['payment_id'], axis = 1, inplace = True)
df_customer.drop(['store_id'], axis = 1, inplace = True)
df_customer.head(2)

,customer_id,first_name,last_name,active,rental_id,amount,payment_date
0,1,MARY,SMITH,1,76,2.99,2005-05-25 11:30:37
1,1,MARY,SMITH,1,573,0.99,2005-05-28 10:35:23

In [21]:
df_store = pd.merge(df_store, df_address, on= "address_id", how = "inner")
df_store.drop(['address_id'], axis = 1, inplace = True)
df_store.head(2)

   store_id             address
0         1   47 MySakila Drive
1         2  28 MySQL Boulevard

In [25]:
df_rental = pd.merge(df_rental, df_inventory, on= "inventory_id", how = "inner")
df_rental.drop(['inventory_id'], axis = 1, inplace = True)
df_rental.head(2)

,rental_id,rental_date,customer_id,return_date,staff_id,title,rental_duration,rental_rate,replacement_cost,address
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive
1,1577,2005-06-16 04:03:28,327,2005-06-24 22:40:28,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive

In [26]:
df_rental = pd.merge(df_rental, df_customer, on= "rental_id", how = "inner")
df_rental.head(2)

,rental_id,rental_date,customer_id_x,return_date,staff_id,title,rental_duration,rental_rate,replacement_cost,address,customer_id_y,first_name,last_name,active,amount,payment_date
0,1,2005-05-24 22:53:30,130,2005-05-26 22:04:30,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,130,CHARLOTTE,HUNTER,1,2.99,2005-05-24 22:53:30
1,1577,2005-06-16 04:03:28,327,2005-06-24 22:40:28,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,327,LARRY,THRASHER,1,3.99,2005-06-16 04:03:28

In [28]:
df_dim_rental_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "rental_date"})
df_rental = pd.merge(df_rental, df_dim_rental_date, on='rental_date', how='left')
df_rental.drop(['rental_date'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,customer_id_x,return_date,staff_id,title,rental_duration,rental_rate,replacement_cost,address,customer_id_y,first_name,last_name,active,amount,payment_date,rental_date_key
0,1,130,2005-05-26 22:04:30,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,130,CHARLOTTE,HUNTER,1,2.99,2005-05-24 22:53:30,NaN
1,1577,327,2005-06-24 22:40:28,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,327,LARRY,THRASHER,1,3.99,2005-06-16 04:03:28,NaN

In [29]:
df_dim_return_date = df_dim_date.rename(columns={"date_key" : "return_date_key", "full_date" : "return_date"})
df_rental = pd.merge(df_rental, df_dim_return_date, on='return_date', how='left')
df_rental.drop(['return_date'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,customer_id_x,staff_id,title,rental_duration,rental_rate,replacement_cost,address,customer_id_y,first_name,last_name,active,amount,payment_date,rental_date_key,return_date_key
0,1,130,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,130,CHARLOTTE,HUNTER,1,2.99,2005-05-24 22:53:30,NaN,NaN
1,1577,327,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,327,LARRY,THRASHER,1,3.99,2005-06-16 04:03:28,NaN,NaN

In [27]:
sql_dim_date = "SELECT date_key, full_date FROM sakila.dim_date;"
df_dim_date = get_dataframe(user_id, pwd, host_name, dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [30]:
df_dim_payment_date = df_dim_date.rename(columns={"date_key" : "payment_date_key", "full_date" : "payment_date"})
df_rental = pd.merge(df_rental, df_dim_payment_date, on='payment_date', how='left')
df_rental.drop(['payment_date'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,customer_id_x,staff_id,title,rental_duration,rental_rate,replacement_cost,address,customer_id_y,first_name,last_name,active,amount,rental_date_key,return_date_key,payment_date_key
0,1,130,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,130,CHARLOTTE,HUNTER,1,2.99,NaN,NaN,NaN
1,1577,327,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,327,LARRY,THRASHER,1,3.99,NaN,NaN,NaN

#### Write back to (fact table) shakila_dw2

In [31]:
table_name = "rental"
primary_key = "rental_id"
db_operation = "insert"
set_dataframe(user_id, pwd, host_name, dbname2, df_rental, table_name, primary_key, db_operation)
df_rental

,rental_id,customer_id_x,staff_id,title,rental_duration,rental_rate,replacement_cost,address,customer_id_y,first_name,last_name,active,amount,rental_date_key,return_date_key,payment_date_key
0,1,130,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,130,CHARLOTTE,HUNTER,1,2.99,NaN,NaN,NaN
1,1577,327,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,327,LARRY,THRASHER,1,3.99,NaN,NaN,NaN
2,3584,207,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,207,GERTRUDE,CASTILLO,1,2.99,NaN,NaN,NaN
3,10507,45,2,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,45,JANET,PHILLIPS,1,2.99,NaN,NaN,NaN
4,13641,281,1,BLANKET BEVERLY,7,2.99,21.99,47 MySakila Drive,281,LEONA,OBRIEN,1,2.99,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16039,16030,137,2,TRAIN BUNCH,3,4.99,26.99,47 MySakila Drive,137,RHONDA,KENNEDY,1,9.99,NaN,NaN,NaN
16040,11486,236,2,GATHERING CALENDAR,4,0.99,22.99,28 MySQL Boulevard,236,MARCIA,DEAN,1,3.99,NaN,NaN,NaN
16041,11986,352,1,GATHERING CALENDAR,4,0.99,22.99,28 MySQL Boulevard,352,ALBERT,CROUSE,1,0.99,NaN,NaN,NaN
16042,11494,579,1,SWARM GOLD,4,0.99,12.99,47 MySakila Drive,579,DARYL,LARUE,1,3.99,NaN,NaN,NaN
16043,13733,85,2,SWARM GOLD,4,0.99,12.99,47 MySakila Drive,85,ANNE,POWELL,1,0.99,NaN,NaN,NaN

#### Proving it contains correct data

In [32]:
sql_test = """
    SELECT customers.`last_name` AS `customer_name`,
        SUM(rentals.`amount`) AS `total_rental_price`
    FROM `{0}`.`rental` AS rentals
    INNER JOIN `{0}`.`dim_customers` AS customers
    ON rentals.customer_id_x = customers.customer_id
    GROUP BY customers.`last_name`
    ORDER BY total_rental_price DESC;
""".format(dbname2)
#testing
df_test = get_dataframe(user_id, pwd, host_name, dbname, sql_test)
df_test.head()

  customer_name  total_rental_price
0          SEAL              221.55
1          HUNT              216.54
2          SHAW              195.58
3       KENNEDY              194.61
4        SNYDER              194.61

#### Now, Importing from MongDB(JSON):

In [ ]:
mysql_uid = "root"
mysql_pwd = "Tallwood2022"

atlas_cluster_name = "sandbox"
atlas_user_name = "dianatuyen"
atlas_password = "Tallwoodis2022"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

dbname = "sakila"
dbname2 = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://m001-student:m001-mongodb-basics@sandbox.zibbf.mongodb.net

In [34]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [35]:
client = pymongo.MongoClient(conn_str["local"])
db = client[sdbname]
data_dir = os.path.join(os.getcwd(), 'data')
# current directory & appends the data directory
json_files = {
              "payment" : 'sakila-payment.json',
              "inventory" : 'sakila-inventory.json', 
                "rental" : 'sakila-rental.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")
        
client.close()

In [36]:
query = {}
collection = "payment"

df_suppliers = get_mongo_dataframe(conn_str['local'], dbname, collection, query)
df_suppliers.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [37]:
query = {}
collection = "inventory"

df_suppliers = get_mongo_dataframe(conn_str['local'], dbname, collection, query)
df_suppliers.head(2)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

#### Load to new dw:

In [38]:
dataframe = df_payment
table_name = 'dim_payment'
primary_key = 'payment_id'
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, dbname2, dataframe, table_name, primary_key, db_operation)

In [39]:
dataframe = df_inventory
table_name = 'dim_inventory'
primary_key = 'inventory_id'
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, dbname2, dataframe, table_name, primary_key, db_operation)

#### Validating new:

In [40]:
sql_payment = "SELECT * FROM sakila_dw2.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, dbname2, sql_payment)
df_dim_payment.head(2)

   payment_id  customer_id  rental_id  amount        payment_date
0           1            1         76    2.99 2005-05-25 11:30:37
1           2            1        573    0.99 2005-05-28 10:35:23

In [41]:
sql_inventory = "SELECT * FROM sakila_dw2.dim_inventory;"
df_dim_inventory = get_sql_dataframe(mysql_uid, mysql_pwd, dbname2, sql_inventory)
df_dim_inventory.head(2)

,inventory_id,title,rental_duration,rental_rate,replacement_cost,address
0,1,ACADEMY DINOSAUR,6,0.99,20.99,47 MySakila Drive
1,2,ACADEMY DINOSAUR,6,0.99,20.99,47 MySakila Drive

#### Create new fact table:

In [42]:
query = {} 
collection = "rental"

df_pos = get_mongo_dataframe(conn_str['local'], dbname, collection, query)
df_pos.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [43]:
df_pos.insert(0, "fact_rental_key", range(1, df_pos.shape[0]+1))
df_pos

,fact_rental_key,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...,...
995,996,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,997,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,998,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,999,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1000,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

#### Load MongoDB into NEW:

In [44]:
dataframe = df_pos
table_name = 'fact_rental'
primary_key = 'Fact_rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dbname2, dataframe, table_name, primary_key, db_operation)

#### Validate new fact table:

In [45]:
sql_rental = "SELECT * FROM sakila_dw2.fact_rental;"
df_fact_rental = get_sql_dataframe(mysql_uid, mysql_pwd, dbname2, sql_rental)
df_fact_rental.head(2)

,fact_rental_key,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53